#### StickSymbolLocation Enumeration

---

|  |
| --- |
| See Also |

Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL\_STICK\_SYMBOL\_LOCATION.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum StickSymbolLocation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StickSymbolLocation ``` |

| Visual C++ |
| --- |
| ``` public enum class StickSymbolLocation ``` |

# Members

| Member name | Description |
| --- | --- |
| StickViewCenter |  |
| StickViewTop |  |
| StickViewBottom |  |
| StickViewLocLine |  |

# See Also

Autodesk.Revit.DB Namespace